# EA_DataAccGetStr

## Description
Returns string value from the object, associated to the accessory index.

```pascal
FUNCTION EA_DataAccGetStr(
				acc        : INTEGER;
				valueIndex : INTEGER): STRING;
```

```python
def vs.EA_DataAccGetStr(acc, valueIndex):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|acc|INTEGER|   |
|valueIndex|INTEGER|   |

## Version
Availability: from Vectorworks 2016

## Category
* EnergyAnalysis Interface Library